espressif/esp-idf/components/soc/esp32h21/register/soc/pmu_struct.h
typedef struct pmu_power_hw_regmap_t
{
    pmu_power_wait_timer0_reg_t   wait_timer0;
    pmu_power_wait_timer1_reg_t   wait_timer1;
    pmu_power_wait_timer2_reg_t   wait_timer2;
    pmu_power_domain_cntl_reg_t   hp_pd[5];   /* for TOP, HPAON, HPCPU, HPPERI and HPWIFI domain power controller */
    pmu_power_domain_cntl_reg_t   lp_peri;
    pmu_power_memory_cntl_reg_t   mem_cntl;
    pmu_power_memory_mask_reg_t   mem_mask;
    pmu_power_hp_pad_reg_t        hp_pad;
    pmu_power_flash_ldo_reg_t     flash_ldo[2];
    pmu_power_vdd_flash_reg_t     vdd_flash;
    pmu_power_io_ldo_reg_t        io_ldo;
    pmu_power_vdd_io_reg_t        vdd_io;
    pmu_power_clk_wait_cntl_reg_t clk_wait;
} pmu_power_hw_regmap_t;

typedef union
{
    struct
    {
        uint32_t reserved0: 31;
        uint32_t sleep_req: 1;
    };
    uint32_t val;
} pmu_slp_wakeup_cntl0_reg_t;

typedef union
{
    struct
    {
        uint32_t sleep_reject_ena: 31;
        uint32_t slp_reject_en   : 1;
    };
    uint32_t val;
} pmu_slp_wakeup_cntl1_reg_t;

typedef union
{
    struct
    {
        uint32_t lp_min_slp_val: 8;
        uint32_t hp_min_slp_val: 8;
        uint32_t sleep_prt_sel : 2;
        uint32_t reserved0     : 14;
    };
    uint32_t val;
} pmu_slp_wakeup_cntl3_reg_t;

typedef union
{
    struct
    {
        uint32_t reserved0           : 31;
        uint32_t slp_reject_cause_clr: 1;
    };
    uint32_t val;
} pmu_slp_wakeup_cntl4_reg_t;

typedef union
{
    struct
    {
        uint32_t modem_wait_target : 20;
        uint32_t reserved0         : 4;
        uint32_t lp_ana_wait_target: 8;
    };
    uint32_t val;
} pmu_slp_wakeup_cntl5_reg_t;

typedef union
{
    struct
    {
        uint32_t soc_wakeup_wait    : 20;
        uint32_t reserved0          : 10;
        uint32_t soc_wakeup_wait_cfg: 2;
    };
    uint32_t val;
} pmu_slp_wakeup_cntl6_reg_t;

typedef union
{
    struct
    {
        uint32_t reserved0       : 15;
        uint32_t ana_wait_clk_sel: 1;
        uint32_t ana_wait_target : 16;
    };
    uint32_t val;
} pmu_slp_wakeup_cntl7_reg_t;

typedef struct pmu_wakeup_hw_regmap_t
{
    pmu_slp_wakeup_cntl0_reg_t cntl0;
    pmu_slp_wakeup_cntl1_reg_t cntl1;
    uint32_t cntl2;
    pmu_slp_wakeup_cntl3_reg_t cntl3;
    pmu_slp_wakeup_cntl4_reg_t cntl4;
    pmu_slp_wakeup_cntl5_reg_t cntl5;
    pmu_slp_wakeup_cntl6_reg_t cntl6;
    pmu_slp_wakeup_cntl7_reg_t cntl7;
    uint32_t status0;
    uint32_t status1;
} pmu_wakeup_hw_regmap_t;

typedef union
{
    struct
    {
        uint32_t i2c_por_wait_target: 8;
        uint32_t reserved0          : 24;
    };
    uint32_t val;
} pmu_hp_clk_poweron_reg_t;

typedef union
{
    struct
    {
        uint32_t modify_icg_cntl_wait: 8;
        uint32_t switch_icg_cntl_wait: 8;
        uint32_t reserved0           : 16;
    };
    uint32_t val;
} pmu_hp_clk_cntl_reg_t;

typedef union
{
    struct
    {
        uint32_t reserved0: 31;
        uint32_t por_done : 1;
    };
    uint32_t val;
} pmu_por_status_reg_t;

typedef union
{
    struct
    {
        uint32_t reserved0      : 26;
        uint32_t xpd_force_rftx : 1;
        uint32_t xpd_perif_i2c  : 1;
        uint32_t xpd_rftx_i2c   : 1;
        uint32_t xpd_rfrx_i2c   : 1;
        uint32_t xpd_rfpll      : 1;
        uint32_t xpd_force_rfpll: 1;
    };
    uint32_t val;
} pmu_rf_pwc_reg_t;

typedef union
{
    struct
    {
        uint32_t vddbat_mode     : 2;
        uint32_t reserved0       : 29;
        uint32_t vddbat_sw_update: 1;
    };
    uint32_t val;
} pmu_vddbat_cfg_reg_t;

typedef union
{
    struct
    {
        uint32_t reserved0          : 31;
        uint32_t backup_sysclk_nodiv: 1;
    };
    uint32_t val;
} pmu_backup_cfg_reg_t;

typedef union
{
    struct
    {
        uint32_t reserved0       : 27;
        uint32_t lp_cpu_exc      : 1;
        uint32_t sdio_idle       : 1;
        uint32_t sw              : 1;
        uint32_t soc_sleep_reject: 1;
        uint32_t soc_wakeup      : 1;
    };
    uint32_t val;
} pmu_hp_intr_reg_t;

typedef struct pmu_hp_ext_hw_regmap_t
{
    pmu_hp_clk_poweron_reg_t clk_poweron;
    pmu_hp_clk_cntl_reg_t    clk_cntl;
    pmu_por_status_reg_t     por_status;
    pmu_rf_pwc_reg_t         rf_pwc;
    pmu_vddbat_cfg_reg_t     vddbat_cfg;
    pmu_backup_cfg_reg_t     backup_cfg;
    pmu_hp_intr_reg_t        int_raw;
    pmu_hp_intr_reg_t        int_st;
    pmu_hp_intr_reg_t        int_ena;
    pmu_hp_intr_reg_t        int_clr;
} pmu_hp_ext_hw_regmap_t;

typedef union
{
    struct
    {
        uint32_t reserved0                : 20;
        uint32_t lp_cpu_wakeup            : 1;
        uint32_t modem_switch_active_end  : 1;
        uint32_t sleep_switch_active_end  : 1;
        uint32_t sleep_switch_modem_end   : 1;
        uint32_t modem_switch_sleep_end   : 1;
        uint32_t active_switch_sleep_end  : 1;
        uint32_t modem_switch_active_start: 1;
        uint32_t sleep_switch_active_start: 1;
        uint32_t sleep_switch_modem_start : 1;
        uint32_t modem_switch_sleep_start : 1;
        uint32_t active_switch_sleep_start: 1;
        uint32_t hp_sw_trigger            : 1;
    };
    uint32_t val;
} pmu_lp_intr_reg_t;

typedef union
{
    struct
    {
        uint32_t waiti_rdy         : 1;
        uint32_t stall_rdy         : 1;
        uint32_t reserved0         : 16;
        uint32_t force_stall       : 1;
        uint32_t slp_waiti_flag_en : 1;
        uint32_t slp_stall_flag_en : 1;
        uint32_t slp_stall_wait    : 8;
        uint32_t slp_stall_en      : 1;
        uint32_t slp_reset_en      : 1;
        uint32_t slp_bypass_intr_en: 1;
    };
    uint32_t val;
} pmu_lp_cpu_pwr0_reg_t;

typedef union
{
    struct
    {
        uint32_t wakeup_en: 16;
        uint32_t reserved0: 15;
        uint32_t sleep_req: 1;
    };
    uint32_t val;
} pmu_lp_cpu_pwr1_reg_t;

typedef struct pmu_lp_ext_hw_regmap_t
{
    pmu_lp_intr_reg_t     int_raw;
    pmu_lp_intr_reg_t     int_st;
    pmu_lp_intr_reg_t     int_ena;
    pmu_lp_intr_reg_t     int_clr;
    pmu_lp_cpu_pwr0_reg_t pwr0;
    pmu_lp_cpu_pwr1_reg_t pwr1;
} pmu_lp_ext_hw_regmap_t;

typedef union
{
    struct
    {
        uint32_t reserved0    : 30;
        uint32_t lp_trigger_hp: 1;
        uint32_t hp_trigger_lp: 1;
    };
    uint32_t val;
} pmu_hp_lp_cpu_comm_reg_t;

typedef union
{
    struct
    {
        uint32_t reserved0           : 31;
        uint32_t dig_regulator_en_cal: 1;
    };
    uint32_t val;
} pmu_hp_regulator_cfg_reg_t;

typedef union
{
    struct
    {
        uint32_t reserved0 : 11;
        uint32_t last_st   : 7;
        uint32_t target_st : 7;
        uint32_t current_st: 7;
    };
    uint32_t val;
} pmu_main_state_reg_t;

typedef union
{
    struct
    {
        uint32_t reserved0: 13;
        uint32_t backup_st: 5;
        uint32_t lp_pwr_st: 5;
        uint32_t hp_pwr_st: 9;
    };
    uint32_t val;
} pmu_pwr_state_reg_t;

typedef union
{
    struct
    {
        uint32_t stable_xpd_bbpll : 1;
        uint32_t stable_xpd_xtal  : 1;
        uint32_t reserved0        : 13;
        uint32_t sysclk_slp_sel   : 1;
        uint32_t sysclk_sel       : 2;
        uint32_t sysclk_nodiv     : 1;
        uint32_t icg_sysclk_en    : 1;
        uint32_t icg_modem_switch : 1;
        uint32_t icg_modem_code   : 2;
        uint32_t icg_slp_sel      : 1;
        uint32_t icg_global_xtal  : 1;
        uint32_t icg_global_pll   : 1;
        uint32_t ana_i2c_iso_en   : 1;
        uint32_t ana_i2c_retention: 1;
        uint32_t ana_xpd_bb_i2c   : 1;
        uint32_t ana_xpd_bbpll_i2c: 1;
        uint32_t ana_xpd_bbpll    : 1;
        uint32_t ana_xpd_xtal     : 1;
    };
    uint32_t val;
} pmu_clk_state0_reg_t;

typedef union
{
    struct {
        uint32_t icg_func_en: 32;
    };
    uint32_t val;
} pmu_clk_state1_reg_t;

typedef union
{
    struct {
        uint32_t icg_apb_en: 32;
    };
    uint32_t val;
} pmu_clk_state2_reg_t;

typedef union
{
    struct
    {
        uint32_t dsfmos_use_por    : 1;
        uint32_t reserved0         : 21;
        uint32_t dcdc_dcm_update   : 1;
        uint32_t dcdc_pcur_limit   : 3;
        uint32_t dcdc_bias_cal_done: 1;
        uint32_t dcdc_ccm_sw_en    : 1;
        uint32_t dcdc_vcm_enb      : 1;
        uint32_t dcdc_ccm_rdy      : 1;
        uint32_t dcdc_vcm_rdy      : 1;
        uint32_t dcdc_rdy_clr      : 1;
    };
    uint32_t val;
} pmu_dcm_ctrl_reg_t;

