espressif/esp-idf/components/soc/esp32h21/register/soc/pmu_struct.h
typedef union {
    struct {
        uint32_t reserved0            :24;
        uint32_t dcdc_boost_ccm_ctrlen:1;
        uint32_t dcdc_boost_ccm_enb   :1;
        uint32_t dcdc_boost_en        :1;
        uint32_t dcdc_boost_dreg      :5;
    };
    uint32_t val;
} pmu_dcm_boost_ctrl_reg_t;

typedef union
{
    struct
    {
        uint32_t sleep_cycles  : 16;
        uint32_t reserved0     : 5;
        uint32_t wait_cycles   : 9;
        uint32_t sleep_timer_en: 1;
        uint32_t force_done    : 1;
    };
    volatile uint32_t val;
} pmu_touch_pwr_ctrl_reg_t;

typedef union {
    struct {
        uint32_t reserved0      :23;
        uint32_t ext_ocode      :8;
        uint32_t ext_force_ocode:1;
    };
    uint32_t val;
} pmu_ble_bandgap_ctrl_reg_t;

typedef struct pmu_dev_t
{
    volatile pmu_hp_hw_regmap_t     hp_sys[3];
    volatile pmu_lp_hw_regmap_t     lp_sys[2];
    volatile pmu_imm_hw_regmap_t    imm;
    volatile pmu_power_hw_regmap_t  power;
    volatile pmu_wakeup_hw_regmap_t wakeup;
    volatile pmu_hp_ext_hw_regmap_t hp_ext;
    volatile pmu_lp_ext_hw_regmap_t lp_ext;

    volatile pmu_hp_lp_cpu_comm_reg_t   hp_lp_cpu_comm;
    volatile pmu_hp_regulator_cfg_reg_t hp_regulator_cfg;

    volatile pmu_main_state_reg_t       main_state;
    volatile pmu_pwr_state_reg_t        pwr_state;
    volatile pmu_clk_state0_reg_t       clk_state0;
    volatile pmu_clk_state1_reg_t       clk_state1;
    volatile pmu_clk_state2_reg_t       clk_state2;

    volatile pmu_dcm_ctrl_reg_t         dcm_ctrl;
    volatile pmu_dcm_boost_ctrl_reg_t   dcm_boost_ctrl;
    volatile pmu_touch_pwr_ctrl_reg_t   touch_pwr_ctrl;
    volatile pmu_ble_bandgap_ctrl_reg_t ble_bandgap_ctrl;

    uint32_t reserved[141];

    union
    {
        struct
        {
            uint32_t pmu_date : 31;
            uint32_t clk_en : 1;
        };
        uint32_t val;
    } date;
} pmu_dev_t;

extern pmu_dev_t PMU;

#ifndef __cplusplus
_Static_assert(sizeof(pmu_dev_t) == 0x400, "Invalid size of pmu_dev_t structure");

_Static_assert(offsetof(pmu_dev_t, reserved) == (PMU_BLE_BANDGAP_CTRL_REG - DR_REG_PMU_BASE) + 4, "Invalid size of pmu_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
